//sample kql
DeviceEvents 
| where TimeGenerated > ago(180d)
| where ActionType startswith 'Asr' and ActionType contains "AsrUntrustedUsbProcess" or ActionType contains "AsrRansomware"
| project Timestamp,DeviceId,ActionType,SHA1,InitiatingProcessFileName
