index=win_events (EventCode=4625) OR (EventCode=4740) OR (EventCode=4771 AND Failure_Code=0x18) OR (EventCode=4776 AND EventCode=windows_incorrect_password_logon_failure)  | rex mode=sed field=Client_Address "s/::ffff://"
| eval d_offender_ip = coalesce(Client_Address,Source_Network_Address)
| eval d_offender_asset = coalesce(Caller_Computer_Name,Workstation_Name)
| eval a_user=mvindex(Account_Name,-1) 
  | eval a_user2=if(EventCode="4740",mvindex(Account_Name,1), mvindex(Account_Name,0) )
    | eval a_user=if(EventCode=4740,a_user, mvindex(Account_Name,1))
| search d_offender_asset!="*" ```change as placeholder```

| stats
values(a_user2)
values(a_user)
values(d_offender_ip)
values(a_asset)
values(d_offender_asset)
values(EventCode)

values(Logon_ID)
values(Logon_Process)
values(Logon_Type)
values(Caller_Process_Name)
values(Authentication_Package)
values(sourcetype) as sourcetype count

values(Failure_Reason) as d_event_message
by a_user
| sort count | reverse
